packages/django-jbank/django-jbank-3.8.6.tar.gz/django-jbank-3.8.6/logs/ws/00000045a.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:pkif="http://danskebank.dk/PKI/PKIFactoryService" xmlns:elem="http://danskebank.dk/PKI/PKIFactoryService/elements">
  <soapenv:Header/>
  <soapenv:Body>
    <pkif:CreateCertificateIn>
      <pkif:RequestHeader>
        <pkif:SenderId>6D3142</pkif:SenderId>
        <pkif:CustomerId>6D3142</pkif:CustomerId>
        <pkif:RequestId>45</pkif:RequestId>
        <pkif:Timestamp>2020-07-20T23:30:56.612712+03:00</pkif:Timestamp>
        <pkif:InterfaceVersion>1</pkif:InterfaceVersion>
        <pkif:Environment>customertest</pkif:Environment>
      </pkif:RequestHeader>
    <EncryptedData xmlns="http://www.w3.org/2001/04/xmlenc#" Type="http://www.w3.org/2001/04/xmlenc#Element">
<EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#tripledes-cbc"/>
<KeyInfo xmlns="http://www.w3.org/2000/09/xmldsig#">
<EncryptedKey xmlns="http://www.w3.org/2001/04/xmlenc#">
<EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5"/>
<KeyInfo xmlns="http://www.w3.org/2000/09/xmldsig#">
<X509Data>
<X509Certificate>MIIFATCCAumgAwIBAgIFAQjv8bkwDQYJKoZIhvcNAQELBQAwgZgxEDAOBgNVBAMT
B0RCR1JPT1QxCzAJBgNVBAYTAkRLMRMwEQYDVQQHEwpDb3BlbmhhZ2VuMRAwDgYD
VQQIEwdEZW5tYXJrMRowGAYDVQQKExFEYW5za2UgQmFuayBHcm91cDEaMBgGA1UE
CxMRRGFuc2tlIEJhbmsgR3JvdXAxGDAWBgNVBAUTDzYxMTI2MjI4MTExMDAwMzAe
Fw0yMDAyMDQxMjAwMDBaFw0yMjAyMDQxMjAwMDBaMIGYMRAwDgYDVQQDEwdEUENS
WVBUMQswCQYDVQQGEwJESzETMBEGA1UEBxMKQ29wZW5oYWdlbjEQMA4GA1UECBMH
RGVubWFyazEaMBgGA1UEChMRRGFuc2tlIEJhbmsgR3JvdXAxGjAYBgNVBAsTEURh
bnNrZSBCYW5rIEdyb3VwMRgwFgYDVQQFEw82MTEyNjIyODQ5MTAwMDkwggEgMA0G
CSqGSIb3DQEBAQUAA4IBDQAwggEIAoIBAQCmSUzQYj0Fx3jwvkz0lhmyyXRKwo5T
hts+1xFrG7euQ6oIMUJJpr8tgKxwDxdxxK/RXaYCHRH9mpIoyxCPlS3reRF4BMB6
gL2KOINnRyC3jmJ7kYHyWdhYfMb5VPIvusqPXc91HdVJb6rxvVSrTy/dB+V1od2q
uHNxA+Luhno37CXU1STrVvSrgHzOm45MROryuOu0lWY+d49tWZN9ilNI2Rf8mJjT
ZVKwJu4v02jXLGAqWpXQX0vxa7nI1D0xkOqnTvd04iDOdDE+jRtiy3SF8508LRqQ
jRH+9TZbX++yFd9Z/AR2h6AwM8OsLSC1QMJG7KeJw8st7K9i8KEOdglpAgEDo1Iw
UDAfBgNVHSMEGDAWgBTrVX/FmGlwJqoQ3fgyj1cJ40A/OjAdBgNVHQ4EFgQUMowN
BX+7Vy5lfO+d+tCxZ+ZupdYwDgYDVR0PAQH/BAQDAgQwMA0GCSqGSIb3DQEBCwUA
A4ICAQA+TV7cAPm5mKIAzTfuS4x4/KAlysTXZ3o0F2fYZmylNnUafi0+T21utPAv
bBYVFpr9fRq+q0L75ZCqU4pDvRLpHF7Q0RZ01ra7otVS78saxc/YUql+MsnHxeUw
9F8FJx7234KlRkhmY8xB743T/LQcp3zCRYUd0Rn2Ocaq7YoYGnx8QALItmJcagsX
MwYVsvXtWHHaDGFpcaivLX3e8cVQ+nI7slq1EfJ5xEdtSZ/zcGv+Ve4S6D1HLQ/K
oTQMzematrVvwwJMuqLMQdA1Pdtau3niupB3Se7AUq0bEZYF04Zlo4sOE21K9gSt
lJ5tSq0ohli02uXuQ/ggsqZSIH4t9WirWOMpS4KFkub02AYaicbm6SUyVg+odEaj
cFz+TEqd9C7cGgBL6MkLxXGj0DX64z4yU9lMlqQ8CzuZi5cMfpxvHVm4E+etLnYf
fzZ6jPnf3RbVumxPaRqnz6vceijWtmESg6cBei+phPzMCjjrXP0xng3+Bzqdn/lY
e8znS54o+UWJcENwvGc6tsUtBYGJOe6srIJHrXQKTG3DN6oDN2U5zT4cUBFvlHjx
fdj14m0Y0+gE90iTUJknWVRyyNDhPbYG1YCHRItVUxpGIp9tsV5FRP5qVbiMC7ba
hEsDAxMvL29i1vJbnJPT9e4OPkhEN5IqVQbu0QeOKMYT/YMZZQ==</X509Certificate>
</X509Data>
</KeyInfo>
<CipherData>
<CipherValue>lwqb4INYbskeQWQaQwkXrq14gykdG8qalYLtLcw/bAJYgOIpRvN3kd6BF4x1cRhl
RjDxjsukFb+zCZ8732SO5tysHoWPmRPXI8gZycgc9W5EmC2iEgg7JNgUlDwmxxlj
kehaeHN6NSZqdT+BKSex4X24iptNC0rvfEvUF9qQn1KIeQt/Vz9uxm3ullXf7qja
07xYFsFb+xoLUj5M5/bATUzOCFQkZ45W9u6cRqI23/IEFDhXeyJzLLJl2esa6b3z
byemh6MgepSC8jb2PPTDxV1sTYfJy3qDoSyGbo6Lh8aiZdBrudHGOkwWsY6OeMdv
pUcPTM43LJ2F3j69AxG/kQ==</CipherValue>
</CipherData>
</EncryptedKey>
</KeyInfo>
<CipherData>
<CipherValue>0zLqSftb+NkPvndXZ025rq570xVP4I5Y8MVSScmq4kXhcm8r2HQxn6fLMXfbNFsR
Q3lYdBhliX0YArFA0tqEw3HxQpTRkjOpRewOs7TERyGoHaT+LxvVTUfpX/NH0WRB
vKWJzMiIE3KKDsVz8bxQFNU+w7DrGg/wP+lDUBgj2vmWG4/FBCESmZAJtc1ZQMkX
dHSmE2d+mhMbhcICBG2bBi234X8vLHoWSdPbJ5pxfzti95u8VyBWiSZgJO4Yx9UG
Mhk2LJ75okZqh/CtNOQvq6FUG64EPB59ElDNUXQ62NgY1nqgEnnxzVxeA9hfcOqM
fpC0J+Yklf9FR/NqtaCjMPyXPmIcxyqUD6AoiQolgOdSjjRZyMXMrD7uXoWh5VmB
qSZudrDuXx5UNlxyKoDdi+ieVgQnCyqhbhQH3g+xGUxse+7Wjh4cTym/m95XgdRu
6r0JF1HEOaq9DA11nNfM75I+xugPvpj+Wu0T3v3mj0lHcAqj+oPTpaHkfBFrZZHs
h2xNcvRYcGPaMVO4Vp7Qhu4/btLDgTFjl89rNtf4+9XvzA0RDB6mP1qAr5t5bUs/
5iTokTo+A7bieige/xNfOYMhOVTa/1uE47GQEWAURJiMx7lSaacapsUo1ZoYnccG
3XPXGAc3D7MC/NTP7IdjchGumKrup2wHZiGIWiBslFRK+wwMoQUvqQQTbNOoMpUa
QXyqW4OH5ab393LNdtQah+P6Fx0aNv8DLuSLw+5DG1udz7l6zRs1P4vAkCPKnnAK
i5p1SvVycbLQFtqTloqn5rX6+IhUnOpzW8UC2pBJo2yUyRuWOG5XMfIWDhYUkO36
jMX8Z6wUZKd/i5dMzrdoVzV4RkCbcYQUZCDspIGbYYRuWIf+/nvLDPrip66u5IUt
xpeUWz2apCOGwyhF+gdeZ73PXXgYKOmVgxLTHmDqi55ONrj7BTtkOH9IxoKsseFw
TMnpJtR9w6cdoYRmeWOI6QUKnnSpmR2h1M8RnOWL4qa+PSsnEYWcovshYCq8IqWI
QlVKhAYqbzIgV+BsY5fS1age7FCPoX+cwrH59xi5+WgUF/3Zn+8mhOygi4GzPwlB
rvta0rUNNCy671+x5xbSsh42gVB7b0Kp7EroBZZpWmd60IrfrcCppR7zHyG2TVyd
CaR3w38M3sssO+T8wFbPY9dsrVLpQvbpgsqbt/LmQ0tS7pRttxypATjC2/Ch6eWd
FrH8ITR5xlC/YSHN5bhZPNSF4O8hB4rnDD6JNjvgdbCM/gfMasIkpFrgOA7mymwa
UBoCwpS7zu/NjGYmZNfq+gvjqCkgE/4Rcy18S/m+MllVKMQN9RPBccqfn/9fWoE6
+umlpnCdKC9Ymr27FgnU9INNuq9RY+Wq/mLnc+iMhtP1uhNOKobomt5jsrksti63
8vWpqhBjb9G9y/8mcSOpTooG8O2ygYkJnF48b862zqJ/P16aLldQJvvFyYsUnMt1
gLYWkzth93XNaOdFXJyH+I0nH41rZ1XAJ1KCMzl8FS0Gw4U2drYhtM8RLRnvhRiJ
O9gBnFumcWmwlVLAj38Y3UGsytmIoorjHDIVFRw6U1/r7ai9HYpMNDROKqNLmGHq
wUwWHq17sp22i925dfAVdm+gu6Z2JLtnZbwwWeeI14SegCRo5MqU4EAnigBvM8L1
gymQzhNC4gMmL1uKIFUYGoqcwFDyjVXOFT29ZcZV1Fi9b4nIMVmERMwU1VLOQjAP
HbzVznJq/WSeYTCL45imU7ry8gTr4Md+mHxQZVSf85pHJ6qNwUzNOo6dLf+hotI+
1L+D2Rag7TX6dQWKRMzy0+e/E/uech1slBINzTySN2LpMbbLJR5dLFfuEWWxL5Em
UGHhYRHwbIXjCEc6MY94LNuPYU+uEr3GcOZoYxOfPUqAqYma/4pzs8qQFelQJqKA
qg0RC7AOCFE81vEAZaDql4JmCH33pQbmnwm3C73pgMTlGeHxdN1CE2xltg3agArg
J3iGZqJZ1PGiqZlgMAmyqyTyhN/nX8TeQT3GLxENOR11r06SIjcs7VEN/cExLH1m
as1/kpdr24DbLl1j1du49WLv04Uz/NZGZ2M5L7kfByot94EgAUimFlBmTMNxs8Fa
CpSFqnkK5MyyZ77z/DBZvhjoDZ+7j66bfioVM5jEOvUNL72ycx2/Upvm87eprEFr
tG2B2oHT7O9pzZoMAmhQWytWF2Q//tiwvOqkV6n6SFX2l9U1yYaA0vjSJlv8FXLh
lu2mw8ZdR8GPu272cHe25qOTBxbWWHKQkKOSCOqmHsqy0Swqer+BKCSZt763J40Z
wSZfCtoiypD9q0M/Pyw5cBn6qQqyB0zh6bRF84BNPgK0O44GdHF+Gxj0oleAxkRM
FzK7gBrQUd/+FOdaXy02P2n4MOnePXz4qe7gZMuAWmDd4BLYTz7YGtgLD75blZbf
LraxLMyAqNo5QaTngsfpNaBf4LFzsxxdDUebfEApt8UyEXhgHwEvUuuFdjTFzKSV
6LXe+7sb4H1Yph+na67yb6V2gyMhSh9Mum8FdPPuGMauKOBOB7tf8jRr204fwOBO
RNfvVISiHWmuTwrWbM02QyKvjH9b/+BcK9eoLisSS3X+yV3a379INj/UltHD/uv5
X76TZIxQOKa5V+PLOpdNhj9qrCAqZe03CCSfI3jW28683SeWcfPRSJsdsdkLKa5j
jx4D1smkhcQxzoV63BOLwykA4+1pWEhf4KworsHFhm05mnqs0krJcE0pfHhkU4Go
eIhKCO/nQQPdLZWe60CxEypptmK4WwXngfjOV8IVesnezkJhpzu3mEMXIk5GLUoW
gYZTtlkNZP8HR856oe7EtO/U1xGqRfmntfUrmu1Qfms1H5HqODd0w3KCi3ps+3BJ
0wcrQEFDrkgThGIYkFtRFZhK4PaCUFABe6rGwd4Eh2h3ax8eAhQ/O6Y5gNv8Xtu7
xtK2pCC4eE8YPxXFhxJiIYVl1Ry7A8PoYdecedI2kbwJnM9yaGZ60K2l/TpS5d85
i3Hyv+KQvZdZRQjFYUoWvhz6D9veZ2iD03fcZoLtXfEfCIm9XGQlYZ4W33YYvxL6
5JWr+JoREpsimyiZRMp7YQs+K2SH4oXz/T6CPxBddgcyw7cM0hACNO5K0emffxpe
NnEdFQPOWsacJe/oGUSwN0rwxQJPkp6cHLo/lHjWyEZeMhM/1dlqmyQjKV5RbMdl
0Er7BlCPM9QiMx7iD/hj5uWoPTWNJs/EhabaGAkJun14nrZsebDirOD5HvlEDQBu
LiahLMejcLenBo0cO1S3RxOP9vevlmiMf7jr5D76HRp58g+/LcleWmVCNZYYFTZb
iJQPLhGF+NrF01V7AmJzOya9X4JYn/+lXuVikt1ACwHFDRxys1ffUhIllBhsEoHa
EY/39pUzZXxVz+Y7wGO0zoIbbJCqwn1mhvWOLzBqL/Wkc26FUFNzMlpsOc+N1o9O
60rZxalo1AyTvfDD2pEN+dYqsknn3+15Y4rPmWgqWRHqXUZ+gzeo+ugrzH3umi+T
u1OVrY5Y4NN7g/w0mX+m8BWsX5v2U8KeixPYWYwtqok8WWmGqhHeAdscdeBV4f1D
hlvbfhncWkyaDvXV/+uMZxIsv1EIPr9J/m215Ig8/g0L+qGB4InHwl1hV9tgAbri</CipherValue>
</CipherData>
</EncryptedData></pkif:CreateCertificateIn>
  </soapenv:Body>
</soapenv:Envelope>